Documents/ПрикрепитьФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>ПрикрепитьФайлы</Name>
			<BasedOn>
				<xr:Item>Catalog.ДолговыеОбязательства</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Catalog.ДоговорыКонтрагентов</xr:Item>
				<xr:Item>Catalog.УслугиПоДоговору</xr:Item>
				<xr:Item>Catalog.ИсполнительныеДокументы</xr:Item>
				<xr:Item>Document.ОбещанныеПлатежи</xr:Item>
				<xr:Item>Document.НеподтвержденныеПлатежи</xr:Item>
				<xr:Item>Catalog.Залоги</xr:Item>
				<xr:Item>Catalog.ФССП_ИсполнительноеПроизводство</xr:Item>
				<xr:Item>Document.СудебноеДело</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПрикрепляемыеФайлы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
						<v8:Type>cfg:CatalogRef.ФССП_ИсполнительноеПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СудебноеДело</v8:Type>
						<v8:Type>cfg:DocumentRef.ПартионнаяПочта</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Залоги</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ИсполнительныеДокументы</v8:Type>
						<v8:Type>cfg:CatalogRef.ДолговыеОбязательства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаСервере</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистраторКорреспонденции</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсходящаяКорреспонденция</v8:Type>
						<v8:Type>cfg:CatalogRef.ВходящаяКорреспонденция</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФайла</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыПрикрепляемыхФайлов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Путь</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Загружен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/ПрикреплениеФайлов/Ext/Module.bsl
Функция ПрикрепитьФайлы(Объект, Эл) Экспорт
	Документ = Документы.ПрикрепитьФайлы.СоздатьДокумент();
	Документ.Организация = ПараметрыСеанса.ТекущийПользователь.Организация;
	Документ.Автор = ПараметрыСеанса.ТекущийПользователь;
	Если ТипЗнч(Объект) = Тип("ДокументСсылка.СудебноеДело") Тогда
		Документ.Объект = Объект.Займ;
	Иначе
		Документ.Объект = Объект;
	КонецЕсли;
	Документ.Дата = ТекущаяДата();
	Документ.Комментарий = "Автоматическое прикрепление";
	//Для Каждого Эл Из Таблица Цикл
		Если Эл.Прикреплять Тогда
			Стр = Документ.Файлы.Добавить();
			Стр.Загружен = Ложь;  
			Стр.Путь = Эл.Путь;
			Стр.ТипФайла = Эл.Шаблон.ТипПрикрепляемогоФайла;
			Стр.Размер = Эл.Размер;
			Стр.УИД = Эл.УИД;
			Стр.Хранилище = Эл.Хранилище;
		КонецЕсли;
	//КонецЦикла;	
	Документ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	//а = 0/0;
	Возврат Документ.Ссылка;
КонецФункции


Функция ОкруглитьРазмерФайла(СтрРазмер)
    Размер = Число(СтрРазмер);
	Если Размер > 1024 Тогда
		Размер = Окр(Размер/1024, 0);
		Стр = Строка(Размер) + " Кб";
	КонецЕсли;
	Если Размер > 1024 Тогда
		Размер = Окр(Размер/1024, 1);
		Стр = Строка(Размер) + " Мб";
	КонецЕсли;
	
	Возврат Стр;		
КонецФункции

Процедура ПакетноеПрикрепление(Организация, Автор, Таблица)
КонецПроцедуры

&НаСервере
Процедура ПоместитьВХранилище(МассивДанных, Таблица) Экспорт
	Индекс = 0;
	Для Каждого Элемент Из Таблица Цикл
		Если МассивДанных[Индекс] <> Неопределено Тогда
			Элемент.Хранилище = Новый ХранилищеЗначения(МассивДанных[Индекс], Новый СжатиеДанных(9));
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;
КонецПроцедуры

Функция ПолучитьКаталог() Экспорт
	Возврат Константы.КаталогХраненияПрикрепляемыхФайловНаСервере.Получить();
КонецФункции

Функция ПолучитьХранение() Экспорт
	Возврат Константы.ХранитьПрикрепляемыеФайлыНаСервере.Получить();
КонецФункции
